<template><div><ul>
<li>三人行，必有我师焉（学习他不买手机，不乱花钱，不用信用卡）想一想你希望成为的那个人怎么做(节约</li>
<li>没有目标你永远不知道去哪里</li>
<li>目标是和优秀的人同行</li>
<li>输出倒逼输入</li>
<li>人性邓伦</li>
<li>人不能细看</li>
<li>君子之交淡如水</li>
<li>just do it 只有做才能发现问题</li>
<li>talk is cheap show me code</li>
<li>有些道理实在是讲不通的，何必浪费口舌，自己做给他们看就行</li>
<li>正反馈</li>
<li>人间无趣，都是欲望和情绪的奴隶
把自己活成一道光</li>
<li>潇洒且硬气</li>
<li>睡也想、醒也想，持续强烈的愿望最重要</li>
<li>想买macbook 权衡到底想要房子还是电脑</li>
<li>不满足就痛苦，满足了就无聊</li>
<li>成熟是一种明亮而不刺眼的光辉</li>
<li>做每一件事想想五年后 十年后</li>
<li>所有的关系都是价值的交换，想一想你能给对方带来什么</li>
<li>每一段经历都有意义，都比安于现状好</li>
<li>fake it util you make it</li>
<li>要学会表达 将自己的优势展示出来 就算你没有也要</li>
<li>思考 我最怕脑袋停止工作</li>
<li>不思考，一辈子穷</li>
<li>人与人并没有多大能力上的差距，而在于思维模式和思考方式和行动  比尔盖茨</li>
<li>学习一项技术的时候要问他能解决什么</li>
<li>睡觉前思考(花时间思考)</li>
<li>自问自答（终极三问）</li>
<li>玩游戏一样学习</li>
<li>生活原则，可要可不要那就不要（节约）</li>
<li>读书或者看视频学习都要带上问题
不要在事上浪费过多的时间，</li>
<li>投资回报率，有限的时间做有限的事，做跳跳够得着的事，人的精力是有限的，</li>
<li>遇到问题的时候第一时间想自己的锤子。（当你只有一把锤子的时候，你看世界都像钉子）</li>
<li>接触是开始的前提</li>
<li>纸上得来终觉浅，绝知此事要躬行</li>
<li>开始才会发现问题</li>
<li>关闭花呗，停用信用卡，自己花的每一笔钱都能得到银行扣款的及时反馈</li>
<li>三个</li>
<li>我见过聪明的人没有一个不读书的</li>
<li>制定目标</li>
<li>追求自己的目标</li>
<li>明确自己的目标，并且找到阻碍你实现目标的问题</li>
<li>目标：做前端leader</li>
<li>面试的问题自己要能解释清楚</li>
<li>多自己问一下</li>
<li>主动睡觉 带问题</li>
<li>结识成功人士</li>
<li>多总收入来源</li>
<li>有自己的精神导师</li>
<li>尊重来源于实力(生命意义在于实力稳步提升)(除了等待一个更好的自己以外，没有什么值得等待)</li>
<li>投入产出最大化，钱用在刀刃上，时间同样，不在一个问题上纠结太久</li>
<li>无能力是最大的不幸</li>
<li>你手上只有一把锤子，你看事物都像一颗钉子</li>
<li>有限的时间做有限的事，投入产出最大化</li>
<li>搞清楚问题的重点，独立思考的能力，不能拾人牙慧，思想也是</li>
<li>人都喜欢最好的，所以让自己变好</li>
<li>你无法赚到你认知以外的钱。</li>
<li>自信来源于实力。</li>
<li>痛苦+反思=进步</li>
<li>多看网页，思考它的实现方式</li>
<li>会赞美、会幽默、会拒绝</li>
<li>总结学到的</li>
<li>要想得到一样东西最好的办法就是配得上它</li>
<li>仰慕是正确的爱的基础(爱靠的是吸引而不是感动)，当自己变得有价值和吸引力时，你会发现是爱情在追你，工作在追你，金钱在追你</li>
<li>必须坚持终身学习(如果不终身学习，将不会取得很高的成就，光靠已有的知识，将不会再生活中走多远)
将不平等最大化通常能够收到奇效
努力让自己发光，对的人才会迎光而来</li>
<li>美好的东西都是价格昂贵的，人生努力的意义就在于有选择生活的权利，遇到自己喜欢的东西能好不犹豫买下来</li>
<li>改变自己是神，改变别人是神经病</li>
<li>你不能改变任何人。你只能改变自己，影响他人</li>
<li>永远不要去和傻逼讲道理，因为你永远讲不过一个傻逼</li>
<li>永远不要试图去改变一个人的想法，那是最愚蠢的行为有思想，</li>
<li>会表达，可以话少，言之有物</li>
<li>不以物喜不以己悲</li>
<li>人与人的关系始终是利益的关系</li>
<li>上善若水</li>
<li>油画中半裸的女人，往往比全裸更诱人。让自己保留一份神秘感会更有吸引力</li>
<li>节约，如果想买一样东西，想想相同价格可以买到什么</li>
<li>学习一样东西先了解它能解决什么.(你无法理解一个东西的时候，最好的办法就是在解决问题的过程中体会它的应用 )</li>
<li>先有问题，再学习，才知道别人讲的什么</li>
<li>不输出的学习都是假学习，无法应用的知识都不算知识</li>
<li>这个世界上根本没有正确的选择，我们只不过是要努力奋斗，使当初的选择变得正确。——村上春树</li>
<li>我喜欢别人说我不行，那么我就会拼尽全力证明我行</li>
<li>学习的过程就是不断发现问题 并解决问题的过程</li>
<li>突破自己的能力边界</li>
<li>除了等待一个更好的自己以外，生命没什么值得等待</li>
<li>对于生活，多做理解，少做判断</li>
<li>生命的意义在于实力稳步提升</li>
<li>你需要一天比一天变得更好，其他的不重要</li>
<li>每天的目标就两件事，提升自己的软件和硬件</li>
<li>刘老师说时间是最大的奢侈</li>
<li>最大的遗憾不是失败，而是我本可以（1919面试）</li>
<li>如果你不想结婚，就给自己买个窝，有一份稳定的工作，买好保险，有时间就到处旅行，老了找个养老院， 就这样过完一生</li>
<li>锦江区时代豪庭三万的单价</li>
<li>思动总</li>
<li>学习的套路，首先需要明确的是，学习是没有捷径的学习需要循序渐进，脚踏实地，所以学习的步骤是
先掌握基础知识，这部分是投入产出最高的部分，掌握这部分就可以掌握60%了</li>
<li>要想问别人问题，第一部分掌握了才能问，这部分可以通过问别人或者花费更多更多时间去学习，掌握这部分就可以掌握20%了
剩下这部分不用可以花费时间去学习</li>
<li>爱与自律</li>
<li>爱是懒惰的对立面，懒惰是因为恐惧，害怕做了没效果，害怕失败
为什么会痛苦，解决痛苦的方法，自律，行动对抗虚无</li>
<li>打怪升级</li>
<li>原则</li>
<li>考虑后续和再后续的结果</li>
<li>把生活想象成一场游戏，每通过一个关卡就获得一样武器，不断拥有更多武器(每一个武器即一项原则)，不断进化装备</li>
<li>感受从犯错中学习的愉悦感</li>
<li>做到头脑极度开放，极度透明，也就是说我正视自己的缺点</li>
<li>完美是不存在的，它是一个目标，激发永不停息的进化过程，加入自然或者任何东西是完美的，它就不会进化，与其顽固的隐藏自己的缺点，假装自己是完美的，不如正视自己的缺点，</li>
<li>从错误中得到教益</li>
<li>进化是宇宙中最强大的力量，是唯一永恒的东西，是一切的驱动力</li>
<li>边际效益：生活中，第一次总是一种罪珍贵的体验，如同初恋往往刻骨铭心，而当你变成情商老手，换过的对象一打又一打，感情的新鲜度也会越来越低，在经济性中，这也被称为边际效用。比如赚钱，人一旦赚钱太多，人从赚钱中获得的边际收益就会变得很小甚至没有</li>
<li>弗洛伊德说，工作和爱是人性的基石</li>
<li>没有痛苦，就没有收获</li>
<li>无论对谁过于热情， 就增加了不被珍惜的概率，倘若没有过度的喜欢，便不会有过度的悲伤  人间失格</li>
<li>胸有大志</li>
<li>代码应该像写诗一样优雅</li>
<li>条条大路通罗马，你只需要找到最简单那一条</li>
<li>从一个人的说话表达就可以看出他的思想</li>
<li>成熟就是以前看不惯的渐渐看得惯了</li>
<li>敬畏时间（yesterday is history tomorrow is mystery today is  a gift）
凡是做过的事情，必须留痕迹
不是不愿意努力，只是怕付出没有回报</li>
<li>人一旦看到自己努力有成功就回加倍努力</li>
<li>杀不死的让我更强大</li>
<li>要知道人生只有一次，不会违背自己的想法勉强自己。伪装自己</li>
<li>欲穷千里目。更上一层楼。</li>
<li>保留一个问题</li>
<li>社交的本质就是各取所需(社交)</li>
<li>人与人的关系始终是利益的关系(社交)</li>
<li>闲时学得忙时用，闲时不学忙时没得用</li>
<li>奔跑的痕迹</li>
<li>只有强者才有选择的权利</li>
<li>杨绛先生曾说，人只有在卑微的时候才有机缘看到世态人情的真相。李健也认为，伟大是用卑微来换取的，“成功晚来一些更好，然后面对那些所谓的权威、显赫的人，不要太害怕。因为他们也走过你今天的路，有多少所谓的闪光，就有多少那些灰暗的时刻，任何时候都应该看清自己，别觉得自己那么渺小，也别觉得自己那么伟大</li>
<li>做可能遇到很多问题 不做永远止步不前</li>
<li>复利</li>
<li>人在尝到甜头后会更加努力</li>
<li>费曼学习法 自问自答</li>
<li>整理</li>
<li>不谋全局者，不足以谋一域。</li>
<li>成长最快的方式，找到一个目标，你想三年后五年后十年后成为什么样的人，找到这样的人，跟在他身边，他怎么样做事，这么样沟通，怎么样为人处世，学习模仿，你就可以离他更近，甚至超越他</li>
<li>人生八苦 生 老 病 死 爱别离 求不得 怨憎会</li>
</ul>
</div></template>
