const str = 1.永远不要自卑

2.永远不要在意任何人的看法

3.永远不要在谈话中自贬，这是一种极为严重的破窗效应

4.已成的事实，不闻不问

5.不以物喜，不以己悲

6.不卑不亢，有分寸

7.精神上不受力：无论发生什么，不要太难受

8.冠军思维：想要做一件事，先把这件事的最高标准一条条默背，了然于心。

9.情绪稳定

10.不卑不亢，做事有分寸

11.决定去爱自己，无条件的爱自己

12.知行合一：知道就能做到

13.要想成为什么样的人，就和这类人接触

14.珍惜时间：时间越来越宝贵

15.不羡慕他人的成功

16.不与上级争锋，不与同级争宠

17.不过度承诺，要量力而行

18.不把安全感建立在他人身上

19.真正让你成长的，恰恰是让你害怕，疼痛的事情

20.不对任何人抱有期望，不要把希望寄托在他人身上

21.不埋怨已发生的事

22.不试图改变他人

23.永远不要纠正他人

24.你才是这个世界的主角，别人都是配角

25.永远相信自己是最厉害的

26.别人指责你，不要太较真

27.没有立即答应，基本都是拒绝

28.相信刻意练习，刻意练习胆量，你会越来越相信自己

29.多在乎自己的感受，少去迎合别人

30.觉得时间越来越宝贵

31.你越冷血，越果断，越不拖泥带水，就越没有人敢欺负你

32.接纳不完美的自己，包括丑陋；懒惰

33.不必向任何人证明任何事

34.不主动帮助任何人

35.自己做什么事，与别人无关

36.不完全信任任何人

37.边界感无论如何都不能丢

38.只要没有利益关系，别人说啥都无需反驳

39.谨言慎行，不让他人抓住自己的把柄

40.定期复盘，养成总结能力

41.学会闭嘴，少一半的麻烦

42.不抱怨，永远积极向上

43.懂得察言观色，知道什么时候该说什么样的话

44.学会分享，分享自己学到的东西，教等于学

45.把时间和精力放在人生中最重要的20％的事情上。

46.看透不说透，静水深流

47.对外人笑脸相迎，但对最亲近的人却恶语相向不负责任的人，不可深交。

48.歇斯底里的打闹往往不会离开，真正要走的人悄无声息。

49.注意力是最值钱的，不要随意浪费。

50.越是愿意无条件帮助一个人，真心就越显得廉价。反而平时高冷一点，偶尔一次伸出援手，别人会感激涕零。

51.你所有的焦虑和担忧，都是因为能力配不上野心。

52.钱不是用一辈子去挣的，而是抓住机遇用2-3年去挣别人挣不到的钱。

53.立即行动，能解决大部分烦恼

54.不把情绪当回事

55.人生只是一场体验，不必演绎完美56.与任何人交往，不要玻璃心

57.一定要永远相信长期主义；时间是杀手锏

58.逢人不必吐真言，孤独是人生的常态

59.离开的人，不看第二眼

60.金钱，可以解决99％的问题

61.冷漠，可以解决80％的麻烦

62.把自己的感受放在第一位

63.少问自己为什么，多问别人凭什么

64.宁可睡地板，也要当老板

65.自己没有实力，认识谁都没有用

66.只做三件事：锻炼；赚钱；学习

67.记住，只有牛羊才会成群，猛兽从来都是独行

68.能用金钱解决的问题，就别用人情

69.能用汗水解决的问题，就别用泪水

70.做人既要有菩萨心肠，也要有屠夫心理

71.什么都可以放弃，唯独不可以放弃赚钱的能力

72.除了生死，一切都是擦伤

73.善良毫无意义，实力才是硬道理

74.赚钱能治愈一切矫情，有钱能治愈一切自卑

75.别贪心，我们不可能什么都有

76.别灰心，我们不可能什么都没有

77.真正聪明的人，通常都不太精明

78.太过精明，本身就是一种愚蠢

79.藏锋，克己，慎言，会让你越来越幸运

80.身体累了就睡觉

81.精神累了就看书

82.经济独立才能受人尊重

83.多念人恩，少思人过

84.别去证明自己，越证明越被动

85.钝感力与屏蔽力结合人生即无敌

86.你羡慕别人的同时别人也在羡慕你

87.真正要做的事情，对神明都不要讲

88.要么努力到出类拔萃，要么就懒得乐知天命

89.人生毫无意义。所有的意义都是人为赋予的

90.时间成本是最大的成本，能花钱找人学习就找人学习。

91.明白一切都需要等价交换

92.强者眼里无对错

93.比努力更重要的，是提升你的思维层次94.有方向的坚持一定是有意义的

95.高价值女生的特点：嘴软心狠

96.不用自己的三观去绑架人

97.毫不在意，才是最高级的拿捏，越拿越重，越捏越小。

98.不要随便可怜别人

99.不被短期利益牵着走

100.眼光放远做长期决策：例如看完我的帖'
